app/views/users/stores/index.html.erb

SELECT "store_images".* FROM "store_images" WHERE "store_images"."store_id" = ?  [["store_id", 2]]
---
					<div class="col-lg-4">
						<% if store.store_images.present? %>