app/views/users/stores/show.html.erb

			<div class="slide" style="margin: 0 auto; text-align: center;">
				<% if @store.store_images.present? %>
---
SELECT "store_images".* FROM "store_images" WHERE "store_images"."store_id" = ?  [["store_id", 1]]