app/controllers/users/stores_controller.rb

  def index
    @enduser = current_user
    @search = Store.ransack(params[:q])
    @stores = @search.result.page(params[:page]).reverse_order.search(params[:search])
---
SELECT  "stores".* FROM "stores" ORDER BY "stores"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]

  def show
    @enduser = current_user
  	@store = Store.find_by(id: params[:id])
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
  	@store = Store.new(store_params)
    @store.user = current_user
  	if @store.save
---
INSERT INTO "stores" ("store_name", "user_id", "genre", "waittime", "release", "area", "price", "station", "people_number", "store_address", "impression", "taste", "appearance", "atmosphere", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @enduser = current_user
  	@store = Store.find_by(id: params[:id])
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
  	@store = Store.find(params[:id])
    @store.user = current_user
  	if @store.update(store_params)
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "stores" SET "taste" = ?, "appearance" = ?, "atmosphere" = ?, "store_address" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "stores"."id" = ?  [["taste", 3.0], ["appearance", 3.0], ["atmosphere", 3.0], ["store_address", "あ"], ["latitude", 43.2203266], ["longitude", 142.8634737], ["updated_at", "2019-08-30 14:25:48.900729"], ["id", 2]]

  def correct_user
    store = Store.find(params[:id])
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]